# -----------------------------------------------------------------------------
# mock-assignment
# 이영호
# 2018/03/07
# -----------------------------------------------------------------------------

# -----------------------------------------------------------------------------
# Question 1
# -----------------------------------------------------------------------------

num <- 1:5

# (1)
num[1]
# [1] 1 : 인덱스 안에 1을 입력하게 되면, num에서 첫 번째 값만 출력하게 된다.

# (2)
num[c(1, 5)] 
# [1] 1 5 : 인덱스 안에 벡터의 형태로 c(1, 5)를 입력하게 되면, 
#           num에서 첫 번째와 다섯 번째 값만 출력하게 된다.

# (3)
num[c(3, NA)] 
# [1] 3 NA : 인덱스 안에 벡터의 형태로 c(3, NA)를 입력하게 되면, num에서 세 번째
#            값과 NA를 출력하게 된다. NA가 출력되는 이유는 NA 위치에 해당하는 
#            값은 없으므로 그에 상응하는 NA가 반환되는 것이다.

# (4)
num[NA] 
# [1] NA NA NA NA NA : 인덱스 안에 NA만을 입력하게 되면, NA는 logical로 인식된다.
# 따라서 NA는 그에 상응하는 NA가 반환되므로, NA가 num의 길이인 5만큼 반환되는 
# 것이다. 

# -----------------------------------------------------------------------------
# Question 2
# -----------------------------------------------------------------------------
interaction.idx <- function(x) {
  
  a <- NULL; b <- NULL; c <- NULL; d <- NULL
  
  for(i in 1:length(x[, 1])) {
    # A x A
    p1 <- ((x[i, 1] / sum(x[, 1])) * x[i, 1] / (x[i, 1] + x[i, 1]))
    a <- sum(a, p1)
    
    # B x A
    p2 <- ((x[i, 2] / sum(x[, 2])) * x[i, 1] / (x[i, 2] + x[i, 1]))
    b <- sum(b, p2)
    
    # A x B
    p3 <- ((x[i, 1] / sum(x[, 1])) * x[i, 2] / (x[i, 1] + x[i, 2]))
    c <- sum(c, p3)
    
    # B x B
    p4 <- ((x[i, 2] / sum(x[, 2])) * x[i, 2] / (x[i, 2] + x[i, 2]))
    d <- sum(d, p4)
  }
  
  print(matrix(c(a, b, c, d), nrow = 2))
}

# -----------------------------------------------------------------------------
# Question 3
# -----------------------------------------------------------------------------
bday <- function(x) {
  if (x <= 0) {
    cat("Error : Unable to calculate.\n")
  } else {
    if (x %% 1 == 0) {
      for(i in 1:length(x)) {
        result <- NULL
        
        p <- 1 - (prod(365:(365 - (x[i] - 1))) / 365 ^ x[i])
        result <- c(result, p)
        
        print(round(result, 4))
      } 
    } else {
      cat("Error : Unable to calculate.\n")
    }
  }
}